# DisableAnalyticalModelCB Class

---
Disable the analytical model for a structural wall.
SystemObject Autodesk.Revit.DBFailureResolution Autodesk.Revit.DBDisableAnalyticalModelCB
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DisableAnalyticalModelCB : FailureResolution

    Public Class DisableAnalyticalModelCB
    	Inherits FailureResolution

    public ref class DisableAnalyticalModelCB : public FailureResolution

    type DisableAnalyticalModelCB =
        class
            inherit FailureResolution
        end
The DisableAnalyticalModelCB type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FailureResolution)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from FailureResolution)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace